<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.keeleysam.recipes.munki.DuoDeviceHealth</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Duo Device Health</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>developer</key>
			<string>Duo Security, Inc.</string>
			<key>display_name</key>
			<string>Duo Device Health</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>preinstall_script</key>
            <string>#!/bin/bash

# If running macOS 11+ then write out this file to allow installation to proceed.
# Needs MDM to deliver a cert profile, as per: https://duo.com/docs/device-health
#
# Get darwin version, pinched, with <3 from: https://stackoverflow.com/a/39499208
# Arguably a cleaner way to detect OS.

if [[ ${OSTYPE:6} -ge 21 ]]
then
    /usr/bin/touch "/Library/Application Support/Duo/Duo Device Health/DisableMacOS11CertManagement"
fi</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.keeleysam.recipes.download.DuoDeviceHealth</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
