<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.keeleysam.recipes.install.DuoDeviceHealth</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Duo Device Health</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.keeleysam.recipes.download.DuoDeviceHealth</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
