<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Opera disk image.</string>
	<key>Identifier</key>
	<string>com.github.keeleysam.recipes.Opera.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Opera</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>OperaURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Opera.app</string>
				<key>requirement</key>
				<string>(identifier "com.operasoftware.Opera" or identifier "com.operasoftware.OperaNext" or identifier "com.operasoftware.OperaDeveloper" or identifier "com.operasoftware.OperaNightly" or identifier "com.operasoftware.OperaGX" or identifier "com.operasoftware.OperaGXNext" or identifier "com.operasoftware.OperaGXDeveloper" or identifier "com.operasoftware.OperaGXNightly" or identifier "com.operasoftware.OperaCrypto" or identifier "com.operasoftware.OperaCryptoNext" or identifier "com.operasoftware.OperaCryptoDeveloper" or identifier "com.operasoftware.OperaCryptoNightly") and (certificate leaf = H"cdf1c39967986616b6cd64c6bd04833a9cb7450d" or certificate leaf = H"89584386993936e6f38e64eed006f705f2570cbf")</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
