<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Munki Imports the latest version of StarTechUSBDriver.</string>
	<key>Identifier</key>
	<string>com.github.bdemetris-recipes.munki.StarTechUSBDriver</string>
	<key>Input</key>
	<dict>
    	<key>MUNKI_REPO_SUBDIR</key>
		<string>drivers/StarTech</string>
		<key>NAME</key>
		<string>StarTechUSBDriver</string>
        <key>FILENAME</key>
        <string>AX88179_178A</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
    <key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>developer</key>
			<string>StarTech</string>
			<key>display_name</key>
			<string>StarTech USB Driver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
    <key>ParentRecipe</key>
	<string>com.github.bdemetris-recipes.download.StarTechUSBDriver</string>
	<key>Process</key>
	<array>
    	<dict>
			<key>Arguments</key>
			<dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%FILENAME%.dmg</string>
				<key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/info.plist</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInfoCreator</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
                <key>plist_version_key</key>
                <string>version</string>
				<key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%FILENAME%.dmg</string>
				<key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>%FILENAME%_v%version%.pkg</string>
                        <key>destination_path</key>
                        <string>%RECIPE_CACHE_DIR%/</string>
                        <key>destination_item</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    </dict>
                </array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>