<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Carbon Copy Cloner.

The VERSION key can be overridden with (at the time of writing), three values:
 - latest (which is the v6 latest)
 - latestbeta (latest v6 beta)
 - 5 (the last release of v5)
</string>
    <key>Identifier</key>
    <string>com.github.keeleysam.recipes.CarbonCopyCloner.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CarbonCopyCloner</string>
        <key>DOWNLOAD_URL</key>
        <string>https://bombich.scdn1.secure.raxcdn.com/download</string>
        <key>VERSION</key>
        <string>latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
                <string>(/software/download_ccc\.php\?v=%VERSION%.*)\"</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://bombich.scdn1.secure.raxcdn.com%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Applications/Carbon Copy Cloner.app</string>
                <key>requirement</key>
                <string>certificate root = H"611e5b662c593a08ff58d14ae22452d198df6c60" and certificate leaf[subject.O] = "Bombich Software"* and identifier "com.bombich.ccc"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
