<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most recent nightly build of FileZilla for Mac.
	
Valid values for ARCH include:
- "x86_64" (default, Intel)
- "aarch64" (Apple Silicon)
Note the architecture values are not the same as the FileZilla stable recipe.
</string>
	<key>Identifier</key>
	<string>com.github.keeleysam.recipes.FileZilla.nightly.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileZilla_nightly</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(/nightlies/[\d-]+/%ARCH%-apple-darwin[\d\.]+/FileZilla\d+\.app\.tar\.bz2)"</string>
				<key>url</key>
				<string>https://filezilla-project.org/nightly.php</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://filezilla-project.org/%match%</string>
				<key>filename</key>
				<string>%NAME%.tar.bz2</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app</string>
				<key>requirement</key>
				<string>identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
