<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the current release version of osquery.</string>
	<key>Identifier</key>
	<string>com.github.keeleysam.recipes.osquery.install</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>osquery</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.osquery.download</string>
	<key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>Installer</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
        </array>
</dict>
</plist>
