<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Caffeine.

For the OS_VERSION_DOWNLOAD variable please use:
- "sonoma"
- "ventura"
- "monterey"</string>
    <key>Identifier</key>
    <string>com.github.keeleysam.recipes.Caffeine.download</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Caffeine-%OS_VERSION_DOWNLOAD%</string>
        <key>OS_VERSION_DOWNLOAD</key>
        <string>monterey</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
                <key>url</key>
                <string>https://www.caffeine-app.net/download/%OS_VERSION_DOWNLOAD%/</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Caffeine.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "net.domzilla.caffeine" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "568T6RKXH7")</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
