<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current installation package for Parallels Desktop 9. Imports it into Munki.</string>
	<key>Input</key>
	<dict>
		<key>IDENTIFIER</key>
		<string>com.github.keeleysam.recipes.ParallelsDesktop9.munki</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Parallels/ParallelsDesktop9</string>
		<key>NAME</key>
		<string>ParallelsDesktop9</string>
		<key>PATH</key>
		<string>Parallels Desktop.app</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>display_name</key>
			<string>Parallels Desktop 9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.ParallelsDesktop.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>description</key>
					<string>%description%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/%PATH%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>%PATH%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
